# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2    #64,320,320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4      128,160,160
   [-1, 3, C3, [128]],                        #128,160,160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8      #256,80,80
   [-1, 6, C3, [256]],                        #256,80,80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16     #512.40.40
   [-1, 9, C3, [512]],                        #512.4040
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32     #768.20.20
   [-1, 3, C3, [768]],                        #768.40.40
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P6/64    #1024.20.20
   [-1, 3, C3, [1024]],                       #1024.20.20
   [-1, 1, Conv, [1280, 3, 2]],  # 11-P7/128  #1280.10.10
#   [-1, 3, CABLock, [1280]],
   [-1, 3, C3TR, [1280]], ##   [-1, 3, C3TR, [1024]],CABLock
   [-1, 1, SPPF, [1280, 5]],  # 13
  ]

# YOLOv5 v6.0 head 这个要改上下层融合，金字塔融合
head:
  [[-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P6
   [-1, 3, C3, [1024, False]],  # 17    #1024.10.10

   [-1, 1, Conv, [768, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P5
   [-1, 3, C3, [768, False]],  # 21   768.20.20

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, SPP, [512, [5, 9, 13]]],
   [-1, 3, C3, [512, False]],  # 26
   [-1, 1, CBAM, [512]],# 27    512.40.40

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, SPP, [256, [5, 9, 13]]],
   [-1, 3, C3, [256, False]],  # 32 (P3/8-small)
   [-1, 1, CBAM, [256]],#33     256.80.80

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 26], 1, Concat, [1]],  # cat head P4
   [-1, 1, SPP, [512, [3, 7, 11]]],
   [-1, 3, C3, [512, False]],  # 37 (P4/16-medium)
   [-1, 1, CBAM, [512]],       # 38 512.40.40

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 22], 1, Concat, [1]],  # cat head P5
   [-1, 1, SPP, [768, [3, 7, 11]]],
   [-1, 3, C3, [768, False]],  # 42 (P5/32-large)
   [-1, 1, CBAM, [768]],#43

   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P6
   [-1, 1, SPP, [1024, [3, 7, 11]]],
   [-1, 3, C3, [1024, False]],  #47  (P6/64-xlarge)
   [-1, 1, CBAM, [1024]],#48

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P7
   [-1, 1, SPP, [1280, [3, 7, 11]]],
   [-1, 3, C3, [1280, False]],  #52 (P7/128-xxlarge)
   [-1, 1, CBAM, [1280]],#53

   [[33, 38, 43, 48, 53], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6, P7)
  ]
